### Terraform "dev"
#### Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.signezily_database.random_string.random_1: Refreshing state... [id=vjzqureeyjrmahfspdfahsnx]
module.signezily_database.random_string.random_2: Refreshing state... [id=axdHQJb3968T6JKx87v3vP50]
module.signezily_database.random_password.random_password: Refreshing state... [id=none]
module.signezily_execution_role.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecsExecutionRole-signezily-dev]
data.aws_vpcs.prod: Reading...
module.signezily.data.aws_region.current: Reading...
module.signezily_execution_role.aws_iam_policy.custom_policy: Refreshing state... [id=arn:aws:iam::898622234277:policy/AmazonECSExecutionRole_CustomPolicy_signezily_dev]
data.aws_security_groups.postgres: Reading...
aws_secretsmanager_secret.signezily: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu]
module.signezily_database.aws_secretsmanager_secret.aws_secretsmanager_secret_rds: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_axdHQJb3968T6JKx87v3vP50-646CNY]
data.aws_db_subnet_group.rds: Reading...
module.signezily.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.signezily.aws_cloudwatch_log_group.tasks[0]: Refreshing state... [id=/ecs/dev/signezily/app]
data.aws_vpcs.prod: Read complete after 0s [id=ap-northeast-1]
data.aws_vpc.prod: Reading...
module.signezily_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-custom-policy-attachment: Refreshing state... [id=ecsExecutionRole-signezily-dev-20250122235151844400000001]
module.signezily_execution_role.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment[0]: Refreshing state... [id=ecsExecutionRole-signezily-dev-20250122235151860200000002]
data.aws_security_groups.postgres: Read complete after 0s [id=ap-northeast-1]
aws_secretsmanager_secret_version.sversion: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:dev/signezily-ZcGHuu|5E61F51B-6B3B-47C9-98C7-CAAC9AC98037]
aws_ecs_task_definition.signezily: Refreshing state... [id=signezily-dev]
data.aws_db_subnet_group.rds: Read complete after 1s [id=main]
module.signezily_database.aws_db_instance.postgres: Refreshing state... [id=dev-signezily-20250123000200045200000001]
data.aws_vpc.prod: Read complete after 1s [id=vpc-02eed9d0b0daadb6a]
data.aws_security_groups.outbound_everywhere: Reading...
data.aws_subnets.prod_private: Reading...
module.signezily.aws_lb_target_group.marketing_site_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-marketing-site-tg/433a8bfd3c7e72a4]
module.signezily.aws_lb_target_group.main["3000"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/signezily-app-dev-3000/4516eb02e93f266d]
module.signezily.aws_security_group.lb[0]: Refreshing state... [id=sg-028be806c1c0271ff]
module.signezily.aws_lb_target_group.documentation_site_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:targetgroup/dev-documentation-site-tg/bb2241051a57baba]
data.aws_subnets.prod_public: Reading...
module.signezily.aws_security_group.ecs_tasks: Refreshing state... [id=sg-0de70c30958aa261f]
module.signezily_database.aws_secretsmanager_secret_version.sversion: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:898622234277:secret:signezily_rds_axdHQJb3968T6JKx87v3vP50-646CNY|EAAD0DBA-3224-41DA-9DA2-935BC6BBDBEC]
data.aws_security_groups.outbound_everywhere: Read complete after 0s [id=ap-northeast-1]
data.aws_subnets.prod_public: Read complete after 0s [id=ap-northeast-1]
module.signezily.data.aws_subnet.lb_subnets["1"]: Reading...
module.signezily.data.aws_subnet.lb_subnets["0"]: Reading...
module.signezily.data.aws_subnet.lb_subnets["2"]: Reading...
data.aws_subnets.prod_private: Read complete after 0s [id=ap-northeast-1]
module.signezily.aws_security_group_rule.ecs_tasks_ingress["3000"]: Refreshing state... [id=sgrule-1760459262]
module.signezily.aws_security_group_rule.lb_ingress["443"]: Refreshing state... [id=sgrule-1239929890]
module.signezily.aws_security_group_rule.lb_redirect[0]: Refreshing state... [id=sgrule-2817597403]
module.signezily.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:loadbalancer/app/signezily-dev/0911cf51887b382f]
module.signezily.data.aws_subnet.lb_subnets["1"]: Read complete after 1s [id=subnet-0686f32cf61665fdc]
module.signezily.data.aws_subnet.lb_subnets["2"]: Read complete after 1s [id=subnet-00096d0dc685bc70b]
module.signezily.data.aws_subnet.lb_subnets["0"]: Read complete after 1s [id=subnet-072c04c7bef15119a]
module.signezily.aws_lb_listener.main["443"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78]
module.signezily.aws_lb_listener.redirect[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener/app/signezily-dev/0911cf51887b382f/660fc083b5bb4ed0]
module.signezily.aws_ecs_service.main_given_task: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:898622234277:service/data/signezily-app-dev]
module.signezily.aws_lb_listener_rule.documentation_site_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/72c663fd6fa15e6d]
module.signezily.aws_lb_listener_rule.marketing_site_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:898622234277:listener-rule/app/signezily-dev/0911cf51887b382f/6b9740226db6ca78/9c336586b5a254cb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.signezily must be replaced
-/+ resource "aws_ecs_task_definition" "signezily" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:898622234277:task-definition/signezily-dev:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  - essential        = true
                  - mountPoints      = []
                    name             = "app"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
              ~ {
                  - cpu              = 0
                  - essential        = true
                  ~ image            = "898622234277.dkr.ecr.ap-northeast-1.amazonaws.com/signezily:marketing_latest" -> "898622234277.dkr.ecr.ap-northeast-1.amazonaws.com/signezily:marketing_1.8.0-rc.3"
                  - mountPoints      = []
                    name             = "marketing"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
              ~ {
                  - cpu              = 0
                  - essential        = true
                  - mountPoints      = []
                    name             = "documentation"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "signezily-dev" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)
    }

  # module.signezily.aws_ecs_service.main_given_task will be updated in-place
  ~ resource "aws_ecs_service" "main_given_task" {
        id                                 = "arn:aws:ecs:ap-northeast-1:898622234277:service/data/signezily-app-dev"
        name                               = "signezily-app-dev"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:898622234277:task-definition/signezily-dev:1" -> (known after apply)
        # (13 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

*Pusher: @gmoraa, Action: `pull_request`*